spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
void SmdSatCmdSpi::read_id(uint32_t *id) {
	if (id == nullptr) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: id ptr is null", __func__);
		return;
	}
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_ID, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read ID", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*id = 0;
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*id |= rx[i] << (8 * i);
	}
	DEBUG_INFO("SmdSatCmdSpi::%s: SMD ID: %u", __func__, *id);
}

void SmdSatCmdSpi::set_id(uint32_t id) {
	DEBUG_TRACE("SmdSatCmdSpi::%s: id: %u", __func__, id);
	uint8_t data[4];
	memcpy(data, &id, sizeof(id));
	if (!send_command_2phase(SMDSAT_CMD_WRITE_ID_REQ, SMDSAT_CMD_WRITE_ID, data, sizeof(data))) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to set ID", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::read_tcxo_warmup(uint32_t *time_ms) {
	if (time_ms == nullptr) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: tcxo ptr is null", __func__);
		return;
	}
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint16_t rx_len = sizeof(rx);
	if (!send_command_auto(SMDSAT_CMD_READ_TCXO, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read TCXO warmup", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
	*time_ms = 0;
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*time_ms |= static_cast<uint32_t>(rx[i]) << (8 * i);
	}
	DEBUG_INFO("SmdSatCmdSpi::%s: SMD TCXO warmup time: %u", __func__, static_cast<unsigned>(*time_ms));
}

void SmdSatCmdSpi::write_tcxo_warmup(uint32_t time_ms) {
	DEBUG_TRACE("SmdSatCmdSpi::%s: tcxo warmup time: %u", __func__, time_ms);
	uint8_t data[4];
	memcpy(data, &time_ms, sizeof(time_ms));
	if (!send_command_2phase(SMDSAT_CMD_WRITE_TCXO_REQ, SMDSAT_CMD_WRITE_TCXO, data, sizeof(data))) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to write TCXO warmup", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::read_serial(smd_uint8_array_t *serial) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	if (serial->size != SMDSAT_CMD_READ_SERIAL_LEN) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Size mismatch %u != %u",
			__func__, serial->size, SMDSAT_CMD_READ_SERIAL_LEN);
		return;
	}
	uint16_t rx_len = serial->size;
	if (!send_command_auto(SMDSAT_CMD_READ_SN, nullptr, 0, serial->p_data, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: Failed to read serial", __func__);
		throw ErrorCode::SPI_COMMS_ERROR;
	}
}

void SmdSatCmdSpi::set_tcxo_warmup_internal(uint32_t time_s)
{
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	this->write_tcxo_warmup(time_s * 1000);
}

void SmdSatCmdSpi::set_tcxo_control(bool state) {
	(void)state;
	DEBUG_TRACE("SmdSatCmdSpi::%s: Managed by SMD module", __func__);
}

void SmdSatCmdSpi::print_firmware_version() {
	// CMD_READ_VERSION (0x05) via A+ - returns firmware version string
	// (CMD_READ_FIRMWARE 0x06 is NOT supported in A+ by STM32 firmware)
	uint8_t rx[SPI_PROTOCOL_APLUS_MAX_DATA_LEN] = {0};
	uint16_t rx_len = sizeof(rx);

	if (!send_command_auto(SMDSAT_CMD_READ_VERSION, nullptr, 0, rx, &rx_len)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: CMD_READ_VERSION failed", __func__);
		return;
	}

	size_t len = 0;
	while (len < rx_len && rx[len] != 0 &&
	       rx[len] >= 0x20 && rx[len] < 0x7F) {
		len++;
	}

	if (len > 0) {
		DEBUG_INFO("SmdSatCmdSpi::%s: Firmware=%.*s", __func__, (int)len, (char*)rx);
	} else {
		DEBUG_WARN("SmdSatCmdSpi::%s: Empty firmware version (rx_len=%u)", __func__, rx_len);
	}
}

bool SmdSatCmdSpi::ping()
{
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
		// Allow one sequence resync attempt per ping retry — if the STM32
		// watchdog reset its counter (5s timeout), the next retry should be
		// able to resynchronize instead of being permanently blocked.
		m_seq_reset_attempted = false;
		try {
			if (send_command_auto(SMDSAT_CMD_PING)) {
				DEBUG_INFO("SmdSatCmdSpi::%s: ACK from SMD received", __func__);
				return true;
			}
		} catch (...) {
			DEBUG_WARN("SmdSatCmdSpi::%s: Ping failed | retry %u/%u", __func__, retry + 1, SMDSAT_SPI_MAX_RETRIES);
		}
		nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
	}

	DEBUG_WARN("SmdSatCmdSpi::%s: Ping not received after %u retries", __func__, SMDSAT_SPI_MAX_RETRIES);
	return false;
}

bool SmdSatCmdSpi::is_tx_finished() {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);

	if (!send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
		// Immediate retry after short delay — avoids waiting a full 500ms poll cycle
		nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
		rx_len = sizeof(rx);
		if (!send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
			DEBUG_WARN("SmdSatCmdSpi::%s: Failed to read SPIMAC state", __func__);
			return false;
		}
	}

	uint8_t mac_status = rx[1];

	DEBUG_TRACE("SmdSatCmdSpi::%s: spiState=%02X macStatus=%02X", __func__, rx[0], mac_status);

	if (mac_status == MAC_TX_DONE) {
		DEBUG_INFO("SmdSatCmdSpi::%s: TX completed successfully", __func__);
		return true;
	}

	if (mac_status == MAC_TX_TIMEOUT) {
		DEBUG_WARN("SmdSatCmdSpi::%s: TX timeout (no satellite)", __func__);
		return true;
	}

	if (mac_status == MAC_ERROR) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: TX error", __func__);
		return true;
	}

	return false;
}

bool SmdSatCmdSpi::is_tx_in_progress() {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	uint8_t rx[4] = {0};
	uint16_t rx_len = sizeof(rx);

	if (!send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
		DEBUG_WARN("SmdSatCmdSpi::%s: Failed to read SPIMAC state", __func__);
		return false;
	}

	return (rx[1] == MAC_TX_IN_PROGRESS);
}

bool SmdSatCmdSpi::initiate_tx(const KineisPacket& payload) {
	DEBUG_TRACE("SmdSatCmdSpi::%s: Size: %u", __func__, payload.size());

	uint16_t size = payload.size();

	// Step 1: WRITE_TX_REQ (0x14) - Prepare for TX
	if (!send_command_auto(SMDSAT_CMD_WRITE_TX_REQ)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: TX REQ failed", __func__);
		return false;
	}

	// Step 2: WRITE_TX_SIZE (0x15) - Send size (little-endian)
	uint8_t size_data[2];
	size_data[0] = size & 0xFF;
	size_data[1] = (size >> 8) & 0xFF;
	if (!send_command_auto(SMDSAT_CMD_WRITE_TX_SIZE, size_data, 2)) {
		DEBUG_ERROR("SmdSatCmdSpi::%s: TX SIZE failed", __func__);
		return false;
	}

