spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
	// Send CRC32 in little-endian format (matches Zephyr argos_dfu_verify)
	uint8_t crc_data[4];
	crc_data[0] = crc32 & 0xFF;
	crc_data[1] = (crc32 >> 8) & 0xFF;
	crc_data[2] = (crc32 >> 16) & 0xFF;
	crc_data[3] = (crc32 >> 24) & 0xFF;

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_VERIFY, crc_data, 4, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		DEBUG_INFO("SmdSatCmdSpi::%s: CRC verification passed", __func__);
	} else {
		DEBUG_ERROR("SmdSatCmdSpi::%s: CRC verification failed", __func__);
	}

	return result;
}

SmdDfuResponse SmdSatCmdSpi::dfu_reset() {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	return dfu_send_command(SMDSAT_CMD_DFU_RESET, nullptr, 0, nullptr, nullptr);
}

// Matches Zephyr argos_dfu_jump() — device may not respond after jump, that's OK
SmdDfuResponse SmdSatCmdSpi::dfu_jump() {
	DEBUG_INFO("SmdSatCmdSpi::%s: Jumping to application...", __func__);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_JUMP, nullptr, 0, nullptr, nullptr);

	// Device may not respond after jump - that's OK (it has already jumped)
	if (result != DFU_RSP_OK) {
		DEBUG_WARN("SmdSatCmdSpi::%s: Jump response: 0x%02X (device may have jumped)", __func__, static_cast<int>(result));
	}

	m_dfu_mode = false;
	nrf_delay_ms(SMDSAT_DFU_RESET_DELAY_MS);

	return DFU_RSP_OK;  // Always return OK — no response means jump succeeded
}

SmdDfuResponse SmdSatCmdSpi::dfu_get_status(uint8_t *status) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	uint8_t response_data[4];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_GET_STATUS, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && status != nullptr && response_len >= 1) {
		*status = response_data[0];
	}

	return result;
}

SmdDfuResponse SmdSatCmdSpi::dfu_abort() {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);
	return dfu_send_command(SMDSAT_CMD_DFU_ABORT, nullptr, 0, nullptr, nullptr);
}

SmdDfuResponse SmdSatCmdSpi::dfu_set_header(const uint8_t *header) {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	if (header == nullptr) {
		return DFU_RSP_ERROR;
	}

	return dfu_send_command(SMDSAT_CMD_DFU_SET_HEADER, header, SMDSAT_DFU_HEADER_SIZE, nullptr, nullptr);
}

// DFU entry sequence — matches Zephyr argos_dfu_enter() + argos_dfu_wait_ready():
//
// STEP 1: SYNC with running app (5x 0xFF frames → expect 0xAA idle)
// STEP 2: PING APP (cmd 0x02) to confirm app is running
// STEP 3: DFU_ENTER (cmd 0x3F, send-only — STM32 jumps to bootloader)
// STEP 4: ACTIVE POLL — send SPI sync frames immediately to lock bootloader
//         into SPI mode (bootloader has 3s UART/SPI detection race!)
// STEP 5: DFU PING (cmd 0x30) with retries to confirm bootloader ready
//
// CRITICAL: The STM32 bootloader races UART vs SPI for 3 seconds after boot.
// The first interface to send valid data wins. If we wait silently, UART noise
// on PA3 can trigger false detection → bootloader deinitializes SPI → all zeros.
// Solution: start sending SPI transactions ASAP after DFU_ENTER (~100ms).

// ============================================================================
// DFU high-level (SPI-specific communication sequence)
// ============================================================================

bool SmdSatCmdSpi::dfu_enter() {
	DEBUG_TRACE("SmdSatCmdSpi::%s", __func__);

	// Reset protocol state
	m_protocol_mode = SpiProtocolMode::APLUS;
	m_protocol_detected = true;
	m_sequence_number = 0;

	// STEP 1: SYNC with APP (5x 0xFF frames)
	DEBUG_INFO("SmdSatCmdSpi::%s: STEP 1 - SPI sync with app...", __func__);
	{
		uint8_t sync_tx[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		uint8_t sync_rx[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		memset(sync_tx, 0xFF, sizeof(sync_tx));

		m_sequence_number = 0;
		for (int i = 0; i < 5; i++) {
			PMU::kick_watchdog();
			memset(sync_rx, 0, sizeof(sync_rx));
			m_nrf_spim->transfer(sync_tx, sync_rx, SPI_PROTOCOL_APLUS_FRAME_SIZE);
			nrf_delay_ms(SMDSAT_SPI_DETECT_TIMEOUT_MS);
		}
	}
	PMU::kick_watchdog();
	nrf_delay_ms(100);

	// STEP 2: PING APP (cmd 0x02)
	DEBUG_INFO("SmdSatCmdSpi::%s: STEP 2 - Ping app...", __func__);
	m_sequence_number = 0;
	{
		SpiAplusResponse app_response;
		bool app_ok = send_command_aplus(SMDSAT_CMD_PING, nullptr, 0, &app_response);
		if (app_ok && app_response.status == SPI_APLUS_STATUS_OK) {
			DEBUG_INFO("SmdSatCmdSpi::%s: APP PING OK!", __func__);
		} else {
			DEBUG_WARN("SmdSatCmdSpi::%s: APP PING failed | checking if already in bootloader...", __func__);
			m_sequence_number = 0;
			SmdDfuResponse bl_ping = dfu_ping_bl();
			if (bl_ping == DFU_RSP_OK) {
				DEBUG_INFO("SmdSatCmdSpi::%s: Already in BOOTLOADER mode!", __func__);
				m_dfu_mode = true;
				return true;
			}
			DEBUG_WARN("SmdSatCmdSpi::%s: No response | trying DFU_ENTER anyway...", __func__);
		}
	}
	PMU::kick_watchdog();
	nrf_delay_ms(200);

	// STEP 3: DFU_ENTER (cmd 0x3F, send-only)
	DEBUG_INFO("SmdSatCmdSpi::%s: STEP 3 - DFU_ENTER...", __func__);
	{
		uint8_t tx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		uint8_t rx_buf[SPI_PROTOCOL_APLUS_FRAME_SIZE];

		build_aplus_frame(tx_buf, SMDSAT_CMD_DFU_ENTER, nullptr, 0);
		memset(rx_buf, 0, sizeof(rx_buf));
		m_nrf_spim->transfer(tx_buf, rx_buf, SPI_PROTOCOL_APLUS_FRAME_SIZE);
		m_sequence_number++;
	}

	m_sequence_number = 0;

	// STEP 4: ACTIVE POLL — aggressive SPI sync to win UART/SPI race
	DEBUG_INFO("SmdSatCmdSpi::%s: STEP 4 - Active SPI sync...", __func__);
	PMU::kick_watchdog();
	nrf_delay_ms(200);

	{
		uint8_t sync_tx[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		uint8_t sync_rx[SPI_PROTOCOL_APLUS_FRAME_SIZE];
		memset(sync_tx, SPI_PROTOCOL_APLUS_IDLE_PATTERN, sizeof(sync_tx));

		bool bootloader_detected = false;

		for (int attempt = 0; attempt < 500; attempt++) {
			if (attempt % 50 == 0) PMU::kick_watchdog();
			memset(sync_rx, 0, sizeof(sync_rx));
			m_nrf_spim->transfer(sync_tx, sync_rx, SPI_PROTOCOL_APLUS_FRAME_SIZE);

			for (int j = 0; j < 8; j++) {
				if (sync_rx[j] == SPI_PROTOCOL_APLUS_IDLE_PATTERN) {
					bootloader_detected = true;
					break;
				}
			}

