spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat_cmd_spi.cpp
			if (attempt < 20 || bootloader_detected || (attempt % 50 == 0)) {
				DEBUG_INFO("SmdSatCmdSpi::%s: Sync %d RX: %02X %02X %02X %02X %02X %02X %02X %02X%s",
				           __func__, attempt, sync_rx[0], sync_rx[1], sync_rx[2], sync_rx[3],
				           sync_rx[4], sync_rx[5], sync_rx[6], sync_rx[7],
				           bootloader_detected ? " <- IDLE" : "");
			}

			if (bootloader_detected) {
				DEBUG_INFO("SmdSatCmdSpi::%s: Bootloader SPI detected after %d sync frames", __func__, attempt + 1);
				break;
			}

			nrf_delay_ms(10);
		}
	}
	PMU::kick_watchdog();
	nrf_delay_ms(50);

	// STEP 5: DFU PING with retries
	DEBUG_INFO("SmdSatCmdSpi::%s: STEP 5 - DFU PING...", __func__);
	{
		constexpr int MAX_PING_ATTEMPTS = 30;
		constexpr int PING_RETRY_DELAY_MS = 100;

		for (int attempt = 0; attempt < MAX_PING_ATTEMPTS; attempt++) {
			m_sequence_number = 0;
			SmdDfuResponse bl_ping = dfu_ping_bl();

			if (bl_ping == DFU_RSP_OK) {
				DEBUG_INFO("SmdSatCmdSpi::%s: BOOTLOADER PING OK!", __func__);
				m_dfu_mode = true;
				return true;
			}

			PMU::kick_watchdog();
			nrf_delay_ms(PING_RETRY_DELAY_MS);
		}
	}

	DEBUG_ERROR("SmdSatCmdSpi::%s: Bootloader not responding", __func__);
	return false;
}

bool SmdSatCmdSpi::dfu_exit() {
	if (!m_dfu_mode) {
		return true;
	}

	SmdDfuResponse result = dfu_jump();
	if (result == DFU_RSP_OK) {
		m_dfu_mode = false;
		return true;
	}
	return false;
}

bool SmdSatCmdSpi::dfu_get_bootloader_info(SmdDfuInfo *info) {
	if (!m_dfu_mode) {
		DEBUG_WARN("SmdSatCmdSpi::%s: Not in DFU mode", __func__);
		return false;
	}
	return (dfu_get_info(info) == DFU_RSP_OK);
}

std::string SmdSatCmdSpi::run_command_test() {
	DEBUG_INFO("SmdSatCmdSpi::%s: === COMMAND TEST START ===", __func__);

	// Verify SPI communication is alive. If ping fails, the A+ sequence
	// may be desynced (e.g. from a previous failed test) — reset and retry.
	bool smd_ready = ping();
	if (!smd_ready) {
		DEBUG_WARN("SmdSatCmdSpi::%s: first ping failed, resync seq", __func__);
		m_sequence_number = 0;
		for (uint8_t attempt = 0; attempt < 10; attempt++) {
			nrf_delay_ms(100);
			if (ping()) {
				smd_ready = true;
				break;
			}
		}
	}

	if (!smd_ready) {
		return "FAIL: SMD not ready (ping failed)";
	}

	struct CmdTest {
		uint8_t cmd;
		const char *name;
	};

	CmdTest tests[] = {
		{ SMDSAT_CMD_PING,             "PING" },
		{ SMDSAT_CMD_READ_VERSION,     "READ_VERSION" },
		{ SMDSAT_CMD_SPI_STATUS,       "SPI_STATUS" },
		{ SMDSAT_CMD_MAC_STATUS,       "MAC_STATUS" },
		{ SMDSAT_CMD_READ_ID,          "READ_ID" },
		{ SMDSAT_CMD_READ_ADDR,        "READ_ADDR" },
		{ SMDSAT_CMD_READ_SN,          "READ_SN" },
		{ SMDSAT_CMD_READ_RCONF,       "READ_RCONF" },
		{ SMDSAT_CMD_READ_KMAC,        "READ_KMAC" },
		{ SMDSAT_CMD_READ_LPM,         "READ_LPM" },
		{ SMDSAT_CMD_READ_SECKEY,      "READ_SECKEY" },
		{ SMDSAT_CMD_READ_SPIMAC_STATE,"READ_SPIMAC_STATE" },
		{ SMDSAT_CMD_READ_RCONF_RAW,   "READ_RCONF_RAW" },
	};

	uint8_t pass_count = 0;
	uint8_t num_tests = sizeof(tests) / sizeof(tests[0]);
	std::string fails;

	try {
		for (uint8_t i = 0; i < num_tests; i++) {
			SpiAplusResponse response = {};
			bool ok = false;
			try {
				ok = send_command_aplus(tests[i].cmd, nullptr, 0, &response);
			} catch (...) {}

			if (ok && response.status == SPI_APLUS_STATUS_OK) {
				pass_count++;
			} else {
				if (!fails.empty()) fails += " ";
				fails += tests[i].name;
			}
			nrf_delay_ms(50);
		}
	} catch (...) {
		return "FAIL: Exception";
	}

	std::string result = std::to_string(pass_count) + "/" + std::to_string(num_tests);
	if (fails.empty()) {
		result += " ALL OK";
	} else {
		result += " FAIL:" + fails;
	}

	// ================================================================
	// Phase 2: TX flow test — reproduces the field failure pattern
	// Tests: RCONF save → KMAC reload → immediate TX → poll result
	// ================================================================
	std::string tx_result = run_tx_flow_test();
	result += " | TX:" + tx_result;

	return result;
}

std::string SmdSatCmdSpi::run_tx_flow_test() {
	DEBUG_INFO("SmdSatCmdSpi::%s: === TX FLOW TEST START ===", __func__);

	std::string result;
	uint8_t tx_pass = 0;
	uint8_t tx_total = 0;

	// Payloads for each modulation
	uint8_t dummy_lda2[ARGOS_TX_LDA2_MIN_BYTE_SIZE] = {0xFF, 0xFF, 0xFF, 0xFF};
	uint8_t dummy_ldk[ARGOS_TX_LDK_PAYLOAD_BYTE_SIZE] = {};
	uint8_t dummy_vlda4[ARGOS_TX_VLDA4_PAYLOAD_BYTE_SIZE] = {0x00, 0x92, 0x00};
	memset(dummy_ldk, 0xFF, sizeof(dummy_ldk));
	KineisPacket pkt_lda2(dummy_lda2, dummy_lda2 + sizeof(dummy_lda2));
	KineisPacket pkt_ldk(dummy_ldk, dummy_ldk + sizeof(dummy_ldk));
	KineisPacket pkt_vlda4(dummy_vlda4, dummy_vlda4 + sizeof(dummy_vlda4));

	// Helper: resync SPI A+ protocol after TX.
	// The TX flow (TX_REQ + TX_SIZE + WRITE_TX + multiple polls) increments
	// the A+ sequence number many times. If any SPI transfer fails or the
	// response is missed, the sequence numbers on nRF and STM32 diverge.
	// All subsequent commands then fail with SEQ_ERROR or INVALID_CMD.
	// A ping is the simplest way to resync — the STM32 accepts it regardless
	// of sequence state.
	// NOTE: No KMAC reload needed here. MAC terminal states (TX_DONE etc.)
	// are overwritten by the next TX initiation. Flash operations (SAVE_RCONF)
	// do not depend on MAC status.
	auto resync_after_tx = [&]() -> bool {
		PMU::kick_watchdog();
		// After TX+poll, the A+ sequence number is heavily desynced
		// (TX_REQ + TX_SIZE + WRITE_TX + N polls = ~16 transactions).
		// A single ping won't fix it. Hard-reset the seq and flush the
		// SPI pipeline with multiple pings, like power_on_blocking() does.
		m_sequence_number = 0;
		nrf_delay_ms(200);
		for (uint8_t attempt = 0; attempt < 5; attempt++) {
			if (ping()) return true;
			nrf_delay_ms(100);
		}
		DEBUG_ERROR("SmdSatCmdSpi::%s: resync failed after 5 pings", __func__);
		return false;
	};

	// Helper: poll READ_SPIMAC_STATE for MAC_OK after KMAC load
	auto wait_mac_ok = [&](uint32_t timeout_ms = 2000) -> bool {
		uint32_t elapsed = 0;
		while (elapsed < timeout_ms) {
			PMU::kick_watchdog();
			uint8_t spi_st = 0, mac_st = 0;
			try { read_spimac_state(&spi_st, &mac_st); } catch (...) {}
			if (mac_st == MAC_OK) return true;
			nrf_delay_ms(100);
			elapsed += 100;
		}
		return false;
	};

	// Helper: run a single TX and return result string
	auto run_tx = [&](const char *tag, const KineisPacket& pkt) -> bool {
		PMU::kick_watchdog();
		tx_total++;
		bool tx_ok = initiate_tx(pkt);
		if (!tx_ok) {
			uint8_t spi_st = 0, mac_st = 0;
			try { read_spimac_state(&spi_st, &mac_st); } catch (...) {}
			result += std::string(tag) + ":REQ_FAIL(spi=" + std::to_string(spi_st) +
			          ",mac=" + std::to_string(mac_st) + ") ";
			return false;
		}
		uint8_t mac_result = poll_tx_result(6000);
		if (mac_result == MAC_TX_DONE || mac_result == MAC_TX_TIMEOUT) {
			tx_pass++;
			result += std::string(tag) + ":OK ";
			return true;
		}
		result += std::string(tag) + ":MAC" + std::to_string(mac_result) + " ";
		return false;
	};

	// Helper: get the right packet for a given modulation
	auto pkt_for_mod = [&](SmdArgosModulation mod) -> const KineisPacket& {
		switch (mod) {
			case ARGOS_MOD_VLDA4: return pkt_vlda4;
			case ARGOS_MOD_LDK:   return pkt_ldk;
			case ARGOS_MOD_LDA2:
			default:              return pkt_lda2;
		}
	};

	// Helper: resync + KMAC load + wait MAC_OK + read modulation
	auto init_and_get_mod = [&]() -> SmdArgosModulation {
		m_sequence_number = 0;
		nrf_delay_ms(100);
		if (!ping()) return ARGOS_MOD_LDA2;

		try { load_kmac_profil(1); } catch (...) { return ARGOS_MOD_LDA2; }

		if (!wait_mac_ok()) return ARGOS_MOD_LDA2;

		// Read parsed RCONF (CMD 0x0A) — returns modulation as byte[9]
		// This works after MAC_OK. Don't use RCONF_RAW (0x2B) which is
		// raw flash with different byte layout.
		// read_radio_conf returns the Kineis KNS_tx_mod_t value directly:
		//   KNS_TX_MOD_LDA2=2, LDA2L=3, VLDA4=4, HDA4=5, LDK=6
		// Our enum: ARGOS_MOD_LDA2=0, ARGOS_MOD_LDK=1, ARGOS_MOD_VLDA4=2
		// We read the raw byte and map it ourselves.
		uint8_t rx_rconf[13] = {0};
		uint16_t rx_len = sizeof(rx_rconf);
		SmdArgosModulation mod = ARGOS_MOD_LDA2;
		if (send_command_auto(SMDSAT_CMD_READ_RCONF, nullptr, 0, rx_rconf, &rx_len) && rx_len >= 10) {
			uint8_t kineis_mod = rx_rconf[9];
			switch (kineis_mod) {
				case 2: case 3: mod = ARGOS_MOD_LDA2; break;   // KNS_TX_MOD_LDA2 / LDA2L
				case 4:         mod = ARGOS_MOD_VLDA4; break;  // KNS_TX_MOD_VLDA4
				case 6:         mod = ARGOS_MOD_LDK; break;    // KNS_TX_MOD_LDK
				default:        mod = ARGOS_MOD_LDA2; break;
			}
			DEBUG_INFO("SmdSatCmdSpi::%s: Kineis mod=%u → enum=%d", __func__, kineis_mod, (int)mod);
		}
		return mod;
	};

	// ================================================================
	// Init: resync + KMAC + read current modulation
	// ================================================================
	SmdArgosModulation cur_mod = init_and_get_mod();
	DEBUG_INFO("SmdSatCmdSpi::%s: current modulation=%d", __func__, (int)cur_mod);

	// ================================================================
	// T1: TX with current modulation (baseline)
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T1] TX mod=%d (%u bytes)", __func__, (int)cur_mod, (unsigned)pkt_for_mod(cur_mod).size());
	run_tx("T1", pkt_for_mod(cur_mod));
	resync_after_tx();

	// ================================================================
	// T2: Back-to-back TX (no config change — verifies resync works)
	// ================================================================
	DEBUG_INFO("SmdSatCmdSpi::%s: [T2] Back-to-back TX", __func__);
	run_tx("T2", pkt_for_mod(cur_mod));
	resync_after_tx();

	std::string summary = std::to_string(tx_pass) + "/" + std::to_string(tx_total);
	if (tx_pass == tx_total) {
		summary += " ALL_OK";
	}
	summary += " [" + result + "]";

	DEBUG_INFO("SmdSatCmdSpi::%s: === TX FLOW TEST END: %s ===", __func__, summary.c_str());
	return summary;
}

uint8_t SmdSatCmdSpi::poll_tx_result(uint32_t timeout_ms) {
	uint32_t elapsed = 0;
	while (elapsed < timeout_ms) {
		PMU::kick_watchdog();
		uint8_t rx[4] = {0};
		uint16_t rx_len = sizeof(rx);
		if (send_command_auto(SMDSAT_CMD_READ_SPIMAC_STATE, nullptr, 0, rx, &rx_len)) {
			uint8_t mac_status = rx[1];
			if (mac_status == MAC_TX_DONE || mac_status == MAC_TX_TIMEOUT ||
			    mac_status == MAC_ERROR || mac_status == MAC_RF_ABORTED ||
			    mac_status == MAC_TX_SIZE_ERROR) {
				DEBUG_INFO("SmdSatCmdSpi::%s: result=%u after %ums", __func__, mac_status, elapsed);
				return mac_status;
			}
		}
		nrf_delay_ms(SMDSAT_TIMING_POLL_MS);
		elapsed += SMDSAT_TIMING_POLL_MS;
	}
	DEBUG_WARN("SmdSatCmdSpi::%s: poll timeout after %ums", __func__, timeout_ms);
	return MAC_ERROR;
}
